artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 50
  processor: "./artillery-processor.js"

scenarios:
  - name: "Submit responses"
    flow:
      - get:
          url: "/api/questions"
          capture:
            - json: "$"
              as: "questionsData"
      - function: "generatePayload"
      - post:
          url: "/api/submit"
          json:
            "{{ payload }}"